tap "fluxcd/tap"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "saulpw/vd"

# Config Management
brew "dockutil"
brew "mas"
brew "stow"

# DevOps
brew "age"
brew "ansible"
brew "git"
brew "helm"
brew "k9s"
brew "kubeconform"
brew "kubernetes-cli"
brew "kustomize"
brew "sops"
brew "fluxcd/tap/flux"
brew "gh"

# Utilities
brew "aria2"
brew "bat"
brew "btop"
brew "curl"
brew "direnv"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "go-task"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "magic-wormhole"
brew "moreutils"
brew "nmap"
brew "starship"
brew "terminal-notifier"
brew "tmux"
brew "watch"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "saulpw/vd/visidata"

# Editor Dependencies
brew "neovim"
brew "ast-grep"
brew "fd"
brew "helm-ls"
brew "luarocks"
brew "markdown-toc"
brew "markdownlint-cli2"
brew "ripgrep"

cask "1password"
cask "balenaetcher"
cask "bettertouchtool"
cask "bruno"
cask "cameracontroller"
cask "cyberduck"
cask "dbeaver-community"
cask "firefox@developer-edition"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "grandperspective"
cask "handbrake"
cask "iina"
cask "kitty"
cask "resilio-sync"
cask "utm"
cask "visual-studio-code"
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Basics
vscode "vscodevim.vim"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "eamodio.gitlens"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "editorconfig.editorconfig"
vscode "mikestead.dotenv"
vscode "vue.volar"

# Language Support
vscode "astro-build.astro-vscode"
vscode "bbenoist.nix"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "ms-vscode.makefile-tools"

## Python
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "zeshuaro.vscode-python-poetry"

## Devops
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "signageos.signageos-vscode-sops"

